Tested this out by running a deploy on an existing instance. It seems to work as expected!

I see these as resources to add:

```
  # aws_secretsmanager_secret.esri_arcgis_api_token_secret will be created
  + resource "aws_secretsmanager_secret" "esri_arcgis_api_token_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = "arn:aws:kms:us-east-2:939721407065:key/2ebd3db8-eda9-4bfb-bf94-f34c021e0d3a"
      + name                           = "dkatz-dev2-civiform_esri_arcgis_api_token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "Environment" = "staging"
          + "Group"       = "dkatz-dev2"
          + "Service"     = "Civiform"
        }
    }

  # aws_secretsmanager_secret_version.esri_arcgis_api_token_secret_version will be created
  + resource "aws_secretsmanager_secret_version" "esri_arcgis_api_token_secret_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

``` 

And in secrets manager I see the added secret
<img width="1079" alt="Screenshot 2024-04-30 at 7 11 28 PM" src="https://github.com/civiform/cloud-deploy-infra/assets/86739416/bce87112-57e7-4500-8dff-d7f07ce5bdda">

